src/Catalogs/РелизыОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>РелизыОбновлений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UpdInfo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ХранилищеРелизовОбновлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеРелизовОбновлений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АрхивЗагруженВХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайлаАрхива</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РелизОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/РелизыОбновлений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
//
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Информация.Заголовок = "Номер релиза должен точно соответствовать номеру устанавливаемого обновления!" + Символы.ПС + 
	"При наличии в каталоге обновления файла UpdInfo.txt информация о релизе будет загружена автоматически."
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ФайлыКонфигураций = НайтиФайлы(Объект.Каталог, "*.cf", Ложь);
	ФайлыОбновлений = НайтиФайлы(Объект.Каталог, "*.cfu", Ложь);
	
	Если ФайлыОбновлений.Количество() = 0 И ФайлыКонфигураций.Количество() = 0 Тогда 
		
		ПараметрыОповещения = Новый Структура("Отказ, ПараметрыЗаписи", Отказ, ПараметрыЗаписи);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюОписаниеОповещенияВопросВыборУказанногоКаталога", ЭтаФорма, ПараметрыОповещения), "В выбранном каталоге не обнаружены фалы обновлений [cf/cfu]!" + Символы.ПС + "Вы уверены, что хотите выбрать указанный каталог?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПередЗаписьюОписаниеОповещенияВопросВыборУказанногоКаталога(РезультатОповещения, ПараметрыОповещения) Экспорт
	
	ПараметрыОповещения.Отказ = (РезультатОповещения = КодВозвратаДиалога.Нет);	
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог обновления";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.Каталог;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.Объект.Каталог = ДиалогВыбораКаталога.Каталог;		
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.Каталог);
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОткрытьАрхивТекущегоРелизаОбновления(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Для доступа к архиву по текущему элементу необходимо сохранить данные!");
		Возврат;
	КонецЕсли;
	
	СоздатьЗаписьАрхиваНаСервере();
	
	ЗначениеКлюча	=    Новый Структура("РелизОбновления", Объект.Ссылка);	
	КлючМассив		=    Новый Массив;
    КлючМассив.Добавить( ЗначениеКлюча );        
    КлючЗаписи		=    Новый("РегистрСведенийКлючЗаписи.ХранилищеРелизовОбновлений", КлючМассив);
	ОткрытьФорму("РегистрСведений.ХранилищеРелизовОбновлений.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
	
КонецПроцедуры

&НаСервере
//
//
Функция СуществуетЗаписьАрхива()
	НаборЗаписей = РегистрыСведений.ХранилищеРелизовОбновлений.СоздатьНаборЗаписей();
	ЭлементОтбора = НаборЗаписей.Отбор.РелизОбновления;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ВидСравнения = ВидСравнения.Равно;
	ЭлементОтбора.Значение = Объект.Ссылка;
	НаборЗаписей.Прочитать();
	Возврат НаборЗаписей.Количество() > 0;
КонецФункции

&НаСервере
//
//
Процедура СоздатьЗаписьАрхиваНаСервере()
	Справочники.РелизыОбновлений.СоздатьЗаписьАрхиваНаСервере(Объект.Ссылка);
КонецПроцедуры
